1.0.0 como fazer as importações e a conexão

In [2]:
from sqlite3.dbapi2 import connect
# abrir  o banco de dados
# importando a biblioteca sql3 e utilizando o as para fornecer um apelido
import sqlite3
 #importando a biblioteca pandas  e utilizando o as para fornecer um apelido

import pandas as pd
conn = sqlite3.connect("database.db")

C:\Users\Thiago\AppData\Local\Temp\ipykernel_10256\3255857298.py:7: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

1- Exercício

In [3]:
# exercicio 1
# ligacao entre tabelas
consulta_atividade="""

  SELECT
    *
  FROM flight_activity fa LEFT JOIN flight_loyalty_history flh ON (fa.loyalty_number= flh. loyalty_number)





"""

# utilizando pandas para buscar e trazer a  consulta dentro do banco de dados utilizando sql misturando os dois DF quer dizer que é uma variavel tipo pandas
df_atividade = pd.read_sql_query(consulta_atividade, conn)
#aqui comando no pandas para trazer as 5 primeiras linhas
df_atividade.head()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed,...,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,100018,2017,1,3,0,3,1521,152.0,0,0,...,Bachelor,92552.0,Married,Aurora,7919.20,Standard,2016,8,NaN,NaN
1,100102,2017,1,10,4,14,2030,203.0,0,0,...,College,NaN,Single,Nova,2887.74,Standard,2013,3,NaN,NaN
2,100140,2017,1,6,0,6,1200,120.0,0,0,...,College,NaN,Divorced,Nova,2838.07,Standard,2016,7,NaN,NaN
3,100214,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,63253.0,Married,Star,4170.57,Standard,2015,8,NaN,NaN
4,100272,2017,1,0,0,0,0,0.0,0,0,...,Bachelor,91163.0,Divorced,Star,6622.05,Standard,2014,1,NaN,NaN

2 busca e unifucando as tabelas

In [12]:
#ecercicio 2
consulta_atividade="""
  SELECT
    *
  FROM flight_loyalty_history





"""


df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,country,province,city,postal_code,gender,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,480934,Canada,Ontario,Toronto,M2Z 4K1,Female,Bachelor,83236.0,Married,Star,3839.14,Standard,2016,2,NaN,NaN
1,549612,Canada,Alberta,Edmonton,T3G 6Y6,Male,College,NaN,Divorced,Star,3839.61,Standard,2016,3,NaN,NaN
2,429460,Canada,British Columbia,Vancouver,V6E 3D9,Male,College,NaN,Single,Star,3839.75,Standard,2014,7,2018.0,1.0
3,608370,Canada,Ontario,Toronto,P1W 1K4,Male,College,NaN,Single,Star,3839.75,Standard,2013,2,NaN,NaN
4,530508,Canada,Quebec,Hull,J8Y 3Z5,Male,Bachelor,103495.0,Married,Star,3842.79,Standard,2014,10,NaN,NaN

In [13]:
 #exercicio 3
consulta_atividade="""
  SELECT
  fa.loyalty_number,
    fa.year,
    fa.month,
    fa.flights_booked,
    fa.total_flights,
    fa.distance,
    fa.points_accumulated

  FROM
  flight_activity fa

  """
df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,total_flights,distance,points_accumulated
0,100018,2017,1,3,3,1521,152.0
1,100102,2017,1,10,14,2030,203.0
2,100140,2017,1,6,6,1200,120.0
3,100214,2017,1,0,0,0,0.0
4,100272,2017,1,0,0,0,0.0

In [12]:
#wxercicio 4
consulta_atividade="""
  SELECT
  fa.loyalty_number,
    fa.year,
    fa.month,
    fa.flights_booked,
    fa.total_flights,
    fa.distance,
    fa.points_accumulated

  FROM
  flight_activity fa

  WHERE
  fa.distance>2000 AND fa.month=9








  """
df_atividade = pd.read_sql_query(consulta_atividade, conn)
df_atividade.head()

,loyalty_number,year,month,flights_booked,total_flights,distance,points_accumulated
0,863070,2017,9,8,15,4245,424.0
1,691626,2018,9,8,15,4245,424.0
2,444931,2017,9,11,18,4428,442.0
3,409051,2018,9,11,18,4428,442.0
4,975387,2018,9,13,18,4428,442.0

3.0 INSPECIONANDO OS DADOS

In [5]:
type (df_atividade)

pandas.core.frame.DataFrame

# como pegar numero de linhas datafreme

In [4]:
df_atividade.shape[0]

405624

# numeros de colunas de um dataframe

In [5]:
df_atividade.shape[1]

26

# Como trazer informações gerais de um datafreme

In [7]:
df_atividade.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 405624 entries, 0 to 405623
Data columns (total 26 columns):
 #   Column                       Non-Null Count   Dtype
---  ------                       --------------   -----
 0   loyalty_number               405624 non-null  int64
 1   year                         405624 non-null  int64
 2   month                        405624 non-null  int64
 3   flights_booked               405624 non-null  int64
 4   flights_with_companions      405624 non-null  int64
 5   total_flights                405624 non-null  int64
 6   distance                     405624 non-null  int64
 7   points_accumulated           405624 non-null  float64
 8   points_redeemed              405624 non-null  int64
 9   dollar_cost_points_redeemed  405624 non-null  int64
 10  loyalty_number               405624 non-null  int64
 11  country                      405624 non-null  object
 12  province                     405624 non-null  object
 13  city                         405624 non-null  object
 14  postal_code                  405624 non-null  object
 15  gender                       405624 non-null  object
 16  education                    405624 non-null  object
 17  salary                       302952 non-null  float64
 18  marital_status               405624 non-null  object
 19  loyalty_card                 405624 non-null  object
 20  clv                          405624 non-null  float64
 21  enrollment_type              405624 non-null  object
 22  enrollment_year              405624 non-null  int64
 23  enrollment_month             405624 non-null  int64
 24  cancellation_year            50064 non-null   float64
 25  cancellation_month           50064 non-null   float64
dtypes: float64(5), int64(12), object(9)
memory usage: 80.5+ MB

# para buscar no  DataFrame um  geral  de todas  as linhas utilizo o  comando  : coloco nome da coluna e para buscar , para efetuar a soma    soma  é utilizado  o comando sum

In [12]:
df_atividade.loc[:,"distance"].sum()

490350765

# para buscar no  DataFrame um  geral  de todas  as linhas utilizo o comando : coloco nome da coluna e para buscar, para efetuar a   media  é utilizado  o comando mean

In [14]:
df_atividade.loc[:,"distance"].mean()

1208.880058872256

# para buscar no   DataFrame um  geral  de todas  as linhas utilizo o comando  : coloco nome da coluna e para buscar, para trazer valores do  minimo  é utilizado  o comando min

In [15]:
df_atividade.loc[:,"distance"].min()

0

 # para buscar no  DataFrame um  geral  de todas  as linhas utilizo  o comando  :  coloco nome da coluna e para buscar, para trazer o valor   maximo   é utilizado  o comando max

In [16]:
df_atividade.loc[:,"distance"].max()

6293

# para utilizar todos os comandos no mesmo bloco é preciso gravar em variaveis depois imprimir com comando print , pois caso nao utilize desta forma ele so ira imprimir o ultimo resultado

In [19]:
soma = df_atividade.loc[:,"distance"].sum()
media = df_atividade.loc[:,"distance"].mean()
minimo= df_atividade.loc[:,"distance"].min()
maximo= df_atividade.loc[:,"distance"].max()
print("os resultados sao:")
print(" a soma é : ",soma)
print(" a media  é : ",media)
print(" a minimo é : ",minimo)
print(" o maximo  é : ",maximo)

os resultados sao:
 a soma é :  490350765
 a media  é :  1208.880058872256
 a minimo é :  0
 o maximo  é :  6293

# para confirmar podemosutilizar o comando para trazer as primeiras 5 linhas

In [10]:
df_atividade.head

<bound method NDFrame.head of         loyalty_number  year  month  flights_booked  flights_with_companions  \
0               100018  2017      1               3                        0
1               100102  2017      1              10                        4
2               100140  2017      1               6                        0
3               100214  2017      1               0                        0
4               100272  2017      1               0                        0
...                ...   ...    ...             ...                      ...
405619          999902  2018     12               0                        0
405620          999911  2018     12               0                        0
405621          999940  2018     12               3                        0
405622          999982  2018     12               0                        0
405623          999986  2018     12               0                        0

        total_flights  distance  points_accumulated  points_redeemed  \
0                   3      1521               152.0                0
1                  14      2030               203.0                0
2                   6      1200               120.0                0
3                   0         0                 0.0                0
4                   0         0                 0.0                0
...               ...       ...                 ...              ...
405619              0         0                 0.0                0
405620              0         0                 0.0                0
405621              3      1233               123.0                0
405622              0         0                 0.0                0
405623              0         0                 0.0                0

        dollar_cost_points_redeemed  ...  education    salary marital_status  \
0                                 0  ...   Bachelor   92552.0        Married
1                                 0  ...    College       NaN         Single
2                                 0  ...    College       NaN       Divorced
3                                 0  ...   Bachelor   63253.0        Married
4                                 0  ...   Bachelor   91163.0       Divorced
...                             ...  ...        ...       ...            ...
405619                            0  ...    College       NaN        Married
405620                            0  ...     Doctor  217943.0         Single
405621                            0  ...   Bachelor   47670.0        Married
405622                            0  ...    College       NaN        Married
405623                            0  ...   Bachelor   46594.0        Married

       loyalty_card       clv enrollment_type enrollment_year  \
0            Aurora   7919.20        Standard            2016
1              Nova   2887.74        Standard            2013
2              Nova   2838.07        Standard            2016
3              Star   4170.57        Standard            2015
4              Star   6622.05        Standard            2014
...             ...       ...             ...             ...
405619       Aurora   7290.07        Standard            2014
405620         Nova   8564.77        Standard            2012
405621         Nova  20266.50        Standard            2017
405622         Star   2631.56        Standard            2018
405623         Nova   8257.01  2018 Promotion            2018

        enrollment_month cancellation_year cancellation_month
0                      8               NaN                NaN
1                      3               NaN                NaN
2                      7               NaN                NaN
3                      8               NaN                NaN
4                      1               NaN                NaN
...                  ...               ...                ...
405619                 5               NaN                NaN
405620                 8               NaN                NaN
405621                 7               NaN                NaN
405622                 7               NaN                NaN
405623                 2               NaN                NaN

[405624 rows x 26 columns]>

 LIMPAR OS DADOS

# Para identificar se possui  linhas nulas usaremos o comando isna: sistema boolean

In [20]:
df_atividade.isna()

,loyalty_number,year,month,flights_booked,flights_with_companions,total_flights,distance,points_accumulated,points_redeemed,dollar_cost_points_redeemed,...,education,salary,marital_status,loyalty_card,clv,enrollment_type,enrollment_year,enrollment_month,cancellation_year,cancellation_month
0,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,True,True
1,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,False,False,True,True
2,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,False,False,True,True
3,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,True,True
4,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,True,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
405619,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,False,False,True,True
405620,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,True,True
405621,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,True,True
405622,False,False,False,False,False,False,False,False,False,False,...,False,True,False,False,False,False,False,False,True,True
405623,False,False,False,False,False,False,False,False,False,False,...,False,False,False,False,False,False,False,False,True,True

3.0 Próxima aula